IDEA Open Model
IntDiagCheckMethod Enumeration
Compatible with IDEA StatiCa 20.1
 Flags controlling the method of the check by a interaction diagram
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum IntDiagCheckMethod
Public Enumeration IntDiagCheckMethod
Members
Member name | Value | Description
IDCheckTypeNuMuMu | 1 |  known Ned,Med; calculate Nrd,Mrd as intersection of ID and line=[0,0];[Ned,Med]
IDCheckTypeNuMM | 2 |  know Med; calculate +-Nrd
IDCheckTypeNMuMu | 4 |  know Ned; calculate +-Mrd
IDOnlyUlsForce1 | 8 |  Find intersection only in the direction of the Fd
IDOnlyPlanarCheck | 16 |  Only planar check is required
IDPlaneInfoRequest | 32 |  Information about plane of deformation is required
IDPlanar_0deg | 64 |  used by CheckForceQuick
IDPlanar_90deg | 128 |  used by CheckForceQuick
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace